#!/usr/bin/env python
# _*_ coding:utf-8 _*_
#
# @Author  : cqq
#
#一个字典中，存放了10个学生的学号（key）和分数（value）；
# 请筛选输出，大于80分的同学（按照格式：学号：分数）；
if __name__ == '__main__':
    student = {'1' : ['01', 87], '2' : ['02', 89], '3' : ['03', 75], '4' : ['04', 66],
                '5' : ['05', 67], '6' : ['06', 88], '7' : ['07', 83], '8' : ['08', 95],
                    '9' : ['09', 55], '10' : ['10', 71]}
    for key, value in student.items():
        if value[1] >= 80:
            print(f"学号：{value[0]}，分数：{value[1]}")